Revit 2027 API
ExternalDataManagerCommandId.Inequality Operator
Compares two ExternalDataManagerCommandId instances.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator !=(
	ExternalDataManagerCommandId first,
	ExternalDataManagerCommandId second
)
Public Shared Operator <> (
	first As ExternalDataManagerCommandId,
	second As ExternalDataManagerCommandId
) As Boolean
public:
static bool operator !=(
	ExternalDataManagerCommandId^ first,
	ExternalDataManagerCommandId^ second
)
static let inline (<>)
        first : ExternalDataManagerCommandId *
        second : ExternalDataManagerCommandId  : bool
Parameters
first ExternalDataManagerCommandId
The first ExternalDataManagerCommandId.
second ExternalDataManagerCommandId
The second ExternalDataManagerCommandId.
Return Value
Boolean
True if the inputs are different, false if they are identical.
See Also
Reference
ExternalDataManagerCommandId Class
Autodesk.Revit.UI Namespace